// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. (Проверка на трехзначность при вводе пользователем)

            // Console.Write("введите трехзначное число: ");
            // int a = int.Parse(Console.ReadLine()!);
            // if (a<0){
            //     a = a*(-1);
            // }
            // int b = a / 100;
            // int c = 1;
            // if (b<10 && b>0){
            // c = a % 100;
            // c = c / 10;
            // Console.Write($"вторая цифра числа - {c} ");
            // }
            // else {
            // Console.Write("вы ввели не трехзначное число ");}

// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. (Максимум 100000)

                                // Console.WriteLine("введите число");
                                // int a = int.Parse(Console.ReadLine()!);
                                // int b = a;
                                // int c = 1;
                                // int d = 0;
                                // if (a < 100){
                                // Console.WriteLine("нет третьей цифры");
                                // d = d + 1;
                                // }
                                // if(a > 100000){
                                // Console.WriteLine("выберии число поменьше");
                                // d = d + 1;
                                // }
                                // if (d == 0){
                                // while (b > 999) {
                                // b = b / 10;
                                // }
                                // c = b % 10;
                                // Console.WriteLine($"третья цифра числа - {c}");
                                // }

// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.(использовать И и ИЛИ)

            // Console.WriteLine("введите число");
            // int a = int.Parse(Console.ReadLine()!);
            // if (a>5 && a<8){
            // Console.WriteLine("да");}
            // else if (a>0 && a<6){
            // Console.WriteLine("нет");}
            // else{
            // Console.WriteLine("введитекорректное число");}