// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

            // Console.Write("Vvedite pervoe chislo:");
            // int a = int.Parse(Console.ReadLine()!);
            // Console.Write("Vvedite vtoroe chislo:");
            // int b = int.Parse(Console.ReadLine()!);
            // if (a>b) 
            // {
            //   Console.Write($"(caislo {a} bolshe {b})");
            // }
            // else if (b>a)
            //      {
            //         Console.Write($"(caislo {b} bolshe {a})");
            //      }
            //      else {
            //         Console.WriteLine("chisla ravni");
            //      }


// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

            Console.Write("Vvedite pervoe chislo:");
            int a = int.Parse(Console.ReadLine()!);
            Console.Write("Vvedite vtoroe chislo:");
            int b = int.Parse(Console.ReadLine()!);
            Console.Write("Vvedite trete chislo:");
            int c = int.Parse(Console.ReadLine()!);
            int max = a;
            if (b>max) {
                max = b;
            }
            if (c>max) {
                max = c;
            }
            Console.WriteLine($"(caislo {max} maximalnoe)");
// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).


// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.



